 gcc -g p1final.c
 ./a.out
enter b,h values
6 4
in the area of triangle=12.000000 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x810: file p1final.c, line 16.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:16
16  {
(gdb) n
18    input(&b,&h);
(gdb) s
input (base=0x7ffdd78ed23c, height=0x7ffdd78ed240) at p1final.c:4
4     printf("enter b,h values\n");
(gdb) n
enter b,h values
5     scanf("%f%f",base,height);
(gdb) n
5
4
6   }
(gdb) n
main () at p1final.c:19
19    find_area(b,h,&area);
(gdb) p a
No symbol "a" in current context.
(gdb) p b
$1 = 5
(gdb) p h
$2 = 4
(gdb) s
find_area (base=5, height=4, area=0x7ffdd78ed244) at p1final.c:9
9   *area=(base*height)/2.0;
(gdb) n
10  }
(gdb) n
main () at p1final.c:20
20    output(b,h,area);
(gdb) p area
$3 = 10
(gdb) s
output (base=5, height=4, area=10) at p1final.c:13
13    printf("in the area of triangle=%f",area);
(gdb) n
14  }
(gdb) n
main () at p1final.c:21
21    return 0;
(gdb) n
22  }(gdb) c
Continuing.
in the area of triangle=10.000000[Inferior 1 (process 120) exited normally]
(gdb) 