gcc -g p2final.c
 ./a.out
Enter a side of the triangle:
5
Enter a side of the triangle:
6
Enter a side of the triangle:
7
The triangle with sides 5, 6 and 7 is scalene
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x850: file p2final.c, line 31.
(gdb) r
Starting program: /home/runner/IA2-Test1-Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:31
31    a = input_side();
(gdb) n
Enter a side of the triangle:
4
32    b = input_side();
(gdb) 6
Undefined command: "6".  Try "help".
(gdb) n
Enter a side of the triangle:
6
33    c = input_side();
(gdb) n
Enter a side of the triangle:
8
34    isScalene= check_scalene(a,b,c);
(gdb) n
35    output(a,b,c, isScalene);
(gdb) s
output (a=4, b=6, c=8, isScalene=1) at p2final.c:19
19    if(isScalene)
(gdb) n
21      printf("The triangle with sides %d, %d and %d is scalene\n", a, b, c);
(gdb) n
The triangle with sides 4, 6 and 8 is scalene
27  }
(gdb) n
main () at p2final.c:36
36    return 0;
(gdb) q
A debugging session is active.

    Inferior 1 [process 78] will be killed.

Quit anyway? (y or n) y
